// נתון מערך :
// let names= ["nadav", "maya", "yonatan", "avi", "yossi", "bat el"]

// 4. הדפיסו את כל התאים שאורך הערך שלהם הוא בין 3 ל-7
// 5. הפכו את הרשימה לערכים של אותיות גדולות
// 6. הדפיסו את מספר התא בו נמצא ערך בעל יותר ממילה אחת, הדפיסו את המילה הראשונה. 
// בונוס - הדפיסו את המילה האחרונה - ב-2 דרכים.
// 7. הדפיסו את כל הערכים בפורמט הבא
//  ______*______**______***______****
// כאשר ______ מייצג ערך/תא.


// 8. צרו רשימה של 10 מספרים
// א. הדפיסו את המספרים עד 2 לפני הסוף.
// ב. הסירו את 3 המספרים הראשונים והדפיסו מיהם היו.


// 9. הדפיסו את כל האותיות בלבד כאותיות גדולות מתוך המחרוזת הבאה:
// "ben##levi###kobi#yossi#avi####dan"

let names= ["nadav", "maya", "yonatan", "avi", "yossi", "bat el"]
for (let i = 0; i < names.length; i++) {
    if (names[i] >3 && names[i] <7)
    console.log(names[i]);
    
}